hulei123/git123/apps/bus_pal/MKV46F15/dspi/fsl_dspi_hal.h
/*******************************************************************************
 * Variables
 ******************************************************************************/

extern const uint32_t spi_base_addr[];

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Configuration
 * @{
 */

/*!
 * @brief Restores the DSPI to reset the configuration.
 *
 * This function basically resets all of the DSPI registers to their default setting including
 * disabling the module.
 *
 * @param baseAddr Module base address
 */
void DSPI_HAL_Init(SPI_Type * baseAddr);

/*!
 * @brief Enables the DSPI peripheral and sets the MCR MDIS to 0.
 *
 * @param baseAddr Module base address
 */
static inline void DSPI_HAL_Enable(SPI_Type * baseAddr)
{
    SPI_WR_MCR_MDIS(baseAddr, 0);
}

/*!
 * @brief Disables the DSPI peripheral, sets MCR MDIS to 1.
 *
 * @param baseAddr Module base address
 */
static inline void DSPI_HAL_Disable(SPI_Type * baseAddr)
{
    SPI_WR_MCR_MDIS(baseAddr, 1);
}

/*!
 * @brief Sets the DSPI baud rate in bits per second.
 *
 * This function  takes in the desired bitsPerSec (baud rate) and  calculates the nearest
 * possible baud rate without exceeding the desired baud rate, and  returns the calculated
 * baud rate in bits-per-second. It requires that the caller also provide the frequency of the
 * module source clock (in Hertz).
 *
 * @param baseAddr Module base address
 * @param whichCtar The desired Clock and Transfer Attributes Register (CTAR) of the type
 *                  dspi_ctar_selection_t
 * @param bitsPerSec The desired baud rate in bits per second
 * @param sourceClockInHz Module source input clock in Hertz
 * @return  The actual calculated baud rate
 */
uint32_t DSPI_HAL_SetBaudRate(SPI_Type * baseAddr, dspi_ctar_selection_t whichCtar,
                              uint32_t bitsPerSec, uint32_t sourceClockInHz);

/*!
 * @brief Configures the baud rate divisors manually.
 *
 * This function allows the caller to manually set the baud rate divisors in the event that
 * these dividers are known and the caller does not wish to call the DSPI_HAL_SetBaudRate function.
 *
 * @param baseAddr Module base address
 * @param whichCtar The desired Clock and Transfer Attributes Register (CTAR) of type
 *                  dspi_ctar_selection_t
 * @param divisors Pointer to a structure containing the user defined baud rate divisor settings
 */
void DSPI_HAL_SetBaudDivisors(SPI_Type * baseAddr,
                              dspi_ctar_selection_t whichCtar,
                              const dspi_baud_rate_divisors_t * divisors);

/*!
 * @brief Configures the DSPI for master or slave.
 *
 * @param baseAddr Module base address
 * @param mode Mode setting (master or slave) of type dspi_master_slave_mode_t
 */
static inline void DSPI_HAL_SetMasterSlaveMode(SPI_Type * baseAddr, dspi_master_slave_mode_t mode)
{
    SPI_WR_MCR_MSTR(baseAddr, (uint32_t)mode);
}

/*!
 * @brief Returns whether the DSPI module is in master mode.
 *
 * @param baseAddr Module base address
 * @return Returns true if the module is in master mode or false if the module is in slave mode.
 */
static inline bool DSPI_HAL_IsMaster(SPI_Type * baseAddr)
{
    return (bool)SPI_RD_MCR_MSTR(baseAddr);
}

/*!
 * @brief Configures the DSPI for the continuous SCK operation.
 *
 * @param baseAddr Module base address
 * @param enable Enables (true) or disables(false) continuous SCK operation.
 */
static inline void DSPI_HAL_SetContinuousSckCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_CONT_SCKE(baseAddr, (enable == true));
}

/*!
 * @brief Configures the DSPI to enable modified timing format.
 *
 * @param baseAddr Module base address
 * @param enable Enables (true) or disables(false) modified timing format.
 */
static inline void DSPI_HAL_SetModifiedTimingFormatCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_MTFE(baseAddr, (enable == true));
}

#if FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE
/*!
 * @brief Configures the DSPI peripheral chip select strobe enable. Configures the PCS[5] to be the
 *        active-low PCS Strobe output.
 *
 * PCS[5] is a special case that can be configured as an active low PCS strobe or as a Peripheral
 * Chip Select in master mode. When configured as a strobe, it provides a signal to an external
 * demultiplexer to decode PCS[0] to PCS[4] signals into as many as 128 glitch-free PCS signals.
 *
 * @param baseAddr Module base address
 * @param enable Enable (true) PCS[5] to operate as the peripheral chip select (PCS) strobe
 *               If disable (false), PCS[5] operates as a peripheral chip select
 */
static inline void DSPI_HAL_SetPcsStrobeCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_PCSSE(baseAddr, (enable == true));
}
#endif

/*!
 * @brief Configures the DSPI received FIFO overflow overwrite enable.
 *
 * When enabled, this function allows incoming receive data to overwrite the existing data in the
 * receive shift register when the Rx FIFO is full.  Otherwise when disabled, the incoming data
 * is ignored when the RX FIFO is full.
 *
 * @param baseAddr Module base address.
 * @param enable If enabled (true), allows incoming data to overwrite Rx FIFO contents when full,
 *               else incoming data is ignored.
 */
static inline void DSPI_HAL_SetRxFifoOverwriteCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_ROOE(baseAddr, (enable == true));
}

/*!
 * @brief Configures the DSPI peripheral chip select polarity.
 *
 * This function  takes in the desired peripheral chip select (PCS) and it's
 * corresponding desired polarity and  configures the PCS signal to operate with the
 * desired characteristic.
 *
 * @param baseAddr Module base address
 * @param pcs The particular peripheral chip select (parameter value is of type
 *            dspi_which_pcs_config_t) for which we wish to apply the active high or active
 *            low characteristic.
 * @param activeLowOrHigh The setting for either "active high, inactive low (0)"  or
 *                        "active low, inactive high(1)" of type dspi_pcs_polarity_config_t.
 */
void DSPI_HAL_SetPcsPolarityMode(SPI_Type * baseAddr, dspi_which_pcs_config_t pcs,
                                 dspi_pcs_polarity_config_t activeLowOrHigh);

/*!
 * @brief Enables (or disables) the DSPI FIFOs.
 *
 * This function  allows the caller to disable/enable the Tx and Rx FIFOs (independently).
 * Note that to disable, the caller must pass in a logic 0 (false) for the particular FIFO
 * configuration.  To enable, the caller must pass in a logic 1 (true).
 *
 * @param baseAddr Module instance number
 * @param enableTxFifo Disables (false) the TX FIFO, else enables (true) the TX FIFO
 * @param enableRxFifo Disables (false) the RX FIFO, else enables (true) the RX FIFO
 */
void DSPI_HAL_SetFifoCmd(SPI_Type * baseAddr, bool enableTxFifo, bool enableRxFifo);

/*!
 * @brief Flushes the DSPI FIFOs.
 *
 * @param baseAddr Module base address
 * @param enableFlushTxFifo Flushes (true) the Tx FIFO, else do not flush (false) the Tx FIFO
 * @param enableFlushRxFifo Flushes (true) the Rx FIFO, else do not flush (false) the Rx FIFO
 */
void DSPI_HAL_SetFlushFifoCmd(SPI_Type * baseAddr, bool enableFlushTxFifo, bool enableFlushRxFifo);


/*!
 * @brief Configures the time when the DSPI master samples SIN in the Modified Transfer Format.
 *
 * This function controls when the DSPI master samples SIN (data in) in the Modified Transfer
 * Format.  Note that this is valid only when the CPHA bit in the CTAR register is 0.
 *
 * @param baseAddr Module base address
 * @param samplePnt selects when the data in (SIN) is sampled, of type dspi_master_sample_point_t.
 *                  This value selects either 0, 1, or 2 system clocks between the SCK edge
 *                  and the SIN (data in) sample.
 */
static inline void DSPI_HAL_SetDatainSamplepointMode(SPI_Type * baseAddr,
                                                   dspi_master_sample_point_t samplePnt)
{
    SPI_WR_MCR_SMPL_PT(baseAddr, samplePnt);
}


/*!
 * @brief Starts the DSPI transfers, clears HALT bit in MCR.
 *
 * This function call called whenever the module is ready to begin data transfers in either master
 * or slave mode.
 *
 * @param baseAddr Module base address
 */
static inline void DSPI_HAL_StartTransfer(SPI_Type * baseAddr)
{
    SPI_WR_MCR_HALT(baseAddr, 0);
}

/*!
 * @brief Stops (halts) DSPI transfers, sets HALT bit in MCR.
 *
 * This function call  stops data transfers in either master or slave mode.
 *
 * @param baseAddr Module base address
 */
static inline void DSPI_HAL_StopTransfer(SPI_Type * baseAddr)
{
    SPI_WR_MCR_HALT(baseAddr, 1);
}

/*!
 * @brief Configures the data format for a particular CTAR.
 *
 * This function configures the bits-per-frame, polarity, phase, and shift direction for a
 * particular CTAR. An example use case is as follows:
   @code
    dspi_data_format_config_t dataFormat;
    dataFormat.bitsPerFrame = 16;
    dataFormat.clkPolarity = kDspiClockPolarity_ActiveLow;
    dataFormat.clkPhase = kDspiClockPhase_FirstEdge;
    dataFormat.direction = kDspiMsbFirst;
    DSPI_HAL_SetDataFormat(instance, kDspiCtar0, &dataFormat);
   @endcode
 *
 * @param baseAddr Module base address
 * @param whichCtar The desired Clock and Transfer Attributes Register (CTAR) of type
 *                  dspi_ctar_selection_t.
 * @param config Pointer to structure containing user defined data format configuration settings.
 * @return  An error code or kStatus_DSPI_Success
 */
dspi_status_t DSPI_HAL_SetDataFormat(SPI_Type * baseAddr,
                                     dspi_ctar_selection_t whichCtar,
                                     const dspi_data_format_config_t * config);

/*!
 * @brief Manually configures the delay prescaler and scaler for a particular CTAR.
 *
 * This function configures the PCS to SCK delay pre-scalar (PCSSCK) and scalar (CSSCK),
 * after SCK delay pre-scalar (PASC) and scalar (ASC), and the delay
 * after transfer pre-scalar (PDT)and scalar (DT).
 *
 * These delay names are available in type dspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the prescaler and scaler value.
 * This  allows the user to directly set the prescaler/scaler values if they have
 * pre-calculated them or if they simply wish to manually increment either value.
 *
 * @param baseAddr Module base address
 * @param whichCtar The desired Clock and Transfer Attributes Register (CTAR) of type
 *                  dspi_ctar_selection_t.
 * @param prescaler The prescaler delay value (can be an integer 0, 1, 2, or 3).
 * @param scaler The scaler delay value (can be any integer between 0 to 15).
 * @param whichDelay The desired delay to configure, must be of type dspi_delay_type_t
 */
void DSPI_HAL_SetDelay(SPI_Type * baseAddr, dspi_ctar_selection_t whichCtar, uint32_t prescaler,
                       uint32_t scaler, dspi_delay_type_t whichDelay);


/*!
 * @brief Calculates the delay prescaler and scaler based on the desired delay input in nanoseconds.
 *
 * This function calculates the values for:
 * PCS to SCK delay pre-scalar (PCSSCK) and scalar (CSSCK), or
 * After SCK delay pre-scalar (PASC) and scalar (ASC), or
 * Delay after transfer pre-scalar (PDT)and scalar (DT).
 *
 * These delay names are available in type dspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the desired delay value in
 * nano-seconds.  The function calculates the values needed for the prescaler and scaler and
 * returning the actual calculated delay as an exact delay match may not be possible. In this
 * case, the closest match is calculated without going below the desired delay value input.
 * It is possible to input a very large delay value that exceeds the capability of the part, in
 * which case the maximum supported delay will be returned. It is to the higher level
 * peripheral driver to alert the user of an out of range delay input.
 *
 * @param baseAddr Module base address
 * @param whichCtar The desired Clock and Transfer Attributes Register (CTAR) of type
 *                  dspi_ctar_selection_t.
 * @param whichDelay The desired delay to configure, must be of type dspi_delay_type_t
 * @param sourceClockInHz Module source input clock in Hertz
 * @param delayInNanoSec The desired delay value in nano-seconds.
 * @return The actual calculated delay value.
 */
uint32_t DSPI_HAL_CalculateDelay(SPI_Type * baseAddr, dspi_ctar_selection_t whichCtar,
                                 dspi_delay_type_t whichDelay, uint32_t sourceClockInHz,
                                 uint32_t delayInNanoSec);

/*!
 * @brief Gets the DSPI master PUSHR data register address for DMA operation.
 *
 * This function gets the DSPI master PUSHR data register address as this value is needed for
 * DMA operation.
 *
 * @param baseAddr Module base address.
 * @return The DSPI master PUSHR data register address.
 */
static inline uint32_t DSPI_HAL_GetMasterPushrRegAddr(SPI_Type * baseAddr)
{
    return (uint32_t)SPI_RD_PUSHR(baseAddr);
}

/*!
 * @brief Gets the DSPI slave PUSHR data register address for DMA operation.
 *
 * This function gets the DSPI slave PUSHR data register address as this value is needed for
 * DMA operation.
 *
 * @param baseAddr Module base address.
 * @return The DSPI slave PUSHR data register address.
 */
static inline uint32_t DSPI_HAL_GetSlavePushrRegAddr(SPI_Type * baseAddr)
{
    return (uint32_t)SPI_RD_PUSHR_SLAVE(baseAddr);
}

/*!
 * @brief Gets the DSPI POPR data register address for DMA operation.
 *
 * This function gets the DSPI POPR data register address as this value is needed for
 * DMA operation.
 *
 * @param baseAddr Module base address.
 * @return The DSPI POPR data register address.
 */
static inline uint32_t DSPI_HAL_GetPoprRegAddr(SPI_Type * baseAddr)
{
    return (uint32_t)SPI_RD_POPR(baseAddr);
}
/*@}*/

/*!
 * @name Low power
 * @{
 */

/*!
 * @brief Configures the DSPI operation during doze mode.
 *
 * This function provides support for an externally controlled doze mode, power-saving, mechanism.
 * When disabled, the doze mode has no effect on the DSPI, and when enabled, the Doze mode
 * disables the DSPI.
 *
 * @param baseAddr Module base address
 * @param enable If disabled (false), the doze mode has no effect on the DSPI, if enabled (true),
 *               the doze mode disables the DSPI.
 */
static inline void DSPI_HAL_SetDozemodeCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_DOZE(baseAddr, (enable == true));
}

/*@}*/

/*!
 * @name Interrupts
 * @{
 */

/*!
 * @brief Configures the DSPI Tx FIFO fill request to generate DMA or interrupt requests.
 *
 * This function configures the DSPI Tx FIFO Fill flag to generate either
 * an interrupt or DMA request.  The user passes in which request they'd like to generate
 * of type dspi_dma_or_int_mode_t and whether or not they wish to enable this request.
 * Note, when disabling the request, the request type is don't care.
   @code
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true); <- to enable DMA
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, true); <- to enable Interrupt
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, false); <- to disable
   @endcode
 * @param baseAddr Module base address
 * @param mode Configures the DSPI Tx FIFO Fill to generate an interrupt or DMA request
 * @param enable Enable (true) or disable (false) the DSPI Tx FIFO Fill flag to generate requests
 */
void DSPI_HAL_SetTxFifoFillDmaIntMode(SPI_Type * baseAddr, dspi_dma_or_int_mode_t mode, bool enable);

/*!
 * @brief Configures the DSPI Rx FIFO Drain request to generate DMA or interrupt requests.
 *
 * This function configures the DSPI Rx FIFO Drain flag to generate either
 * an interrupt or a DMA request.  The user passes in which request they'd like to generate
 * of type dspi_dma_or_int_mode_t and whether or not they wish to enable this request.
 * Note, when disabling the request, the request type is don't care.
   @code
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, true); <- to enable DMA
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, true); <- to enable Interrupt
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, false); <- to disable
   @endcode
 * @param baseAddr Module base address
 * @param mode Configures the Rx FIFO Drain to generate an interrupt or DMA request
 * @param enable Enable (true) or disable (false) the Rx FIFO Drain flag to generate requests
 */
void DSPI_HAL_SetRxFifoDrainDmaIntMode(SPI_Type * baseAddr, dspi_dma_or_int_mode_t mode, bool enable);



/*!
 * @brief Configures the DSPI interrupts.
 *
 * This function configures the various interrupt sources of the DSPI.  The parameters are
 * baseAddr, interrupt source, and enable/disable setting.
 * The interrupt source is a typedef enumeration whose value is the bit position of the
 * interrupt source setting within the RSER register.  In the DSPI, all interrupt
 * configuration settings are in  one register.  The typedef enum  equates each
 * interrupt source to the bit position defined in the device header file.
 * The function  uses these bit positions in its algorithm to enable/disable the
 * interrupt source, where interrupt source is the dspi_status_and_interrupt_request_t type.
 * Note, for Tx FIFO Fill and Rx FIFO Drain requests, use the functions:
 * DSPI_HAL_SetTxFifoFillDmaIntMode and DSPI_HAL_SetRxFifoDrainDmaIntMode respectively as
 * these requests can generate either an interrupt or DMA request.
   @code
    DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true); <- example use-case
   @endcode
 *
 * @param baseAddr Module base address
 * @param interruptSrc The interrupt source, of type dspi_status_and_interrupt_request_t
 * @param enable Enable (true) or disable (false) the interrupt source to generate requests
 */
void DSPI_HAL_SetIntMode(SPI_Type * baseAddr,
                              dspi_status_and_interrupt_request_t interruptSrc,
                              bool enable);


/*!
 * @brief Gets DSPI interrupt configuration, returns if interrupt request is enabled or disabled.
 *
 * This function  returns the requested interrupt source setting (enabled or disabled, of
 * type bool).  The parameters to pass in are baseAddr and interrupt source.  It  utilizes the
 * same enumeration definitions for the interrupt sources as described in the "interrupt configuration"
 * function. The function  uses these bit positions in its algorithm to obtain the desired
 * interrupt source setting.
 * Note, for Tx FIFO Fill and Rx FIFO Drain requests, this returns whether or not their
 * requests are enabled.
   @code
   getInterruptSetting = DSPI_HAL_GetIntMode(baseAddr, kDspiTxComplete);
   @endcode
 *
 * @param baseAddr Module base address
 * @param interruptSrc The interrupt source, of type dspi_status_and_interrupt_request_t
 * @return Configuration of interrupt request: enable (true) or disable (false).
 */
static inline bool DSPI_HAL_GetIntMode(SPI_Type * baseAddr,
                                             dspi_status_and_interrupt_request_t interruptSrc)
{
    return ((SPI_RD_RSER(baseAddr) >> interruptSrc) & 0x1);
}

/*@}*/

/*!
 * @name Status
 * @{
 */

/*!
 * @brief Gets the DSPI status flag state.
 *
 * The status flag  is defined in the same enumeration as the interrupt source enable because the bit
 * position of the interrupt source and corresponding status flag are the same in the RSER and
 * SR registers.  The function  uses these bit positions in its algorithm to obtain the desired
 * flag state, similar to the dspi_get_interrupt_config function.
   @code
    getStatus = DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxComplete);
   @endcode
 *
 * @param baseAddr Module base address
 * @param statusFlag The status flag, of type dspi_status_and_interrupt_request_t
 * @return State of the status flag: asserted (true) or not-asserted (false)
 */
static inline bool DSPI_HAL_GetStatusFlag(SPI_Type * baseAddr,
                                        dspi_status_and_interrupt_request_t statusFlag)
{
    return ((SPI_RD_SR(baseAddr) >> statusFlag) & 0x1);
}

/*!
 * @brief Clears the DSPI status flag.
 *
 * This function  clears the desired status bit by using a write-1-to-clear.  The user passes in
 * the baseAddr and the desired status bit to clear.  The list of status bits is defined in the
 * dspi_status_and_interrupt_request_t.  The function  uses these bit positions in its algorithm
 * to clear the desired flag state. Example usage:
   @code
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
   @endcode
 *
 * @param baseAddr Module base address
 * @param statusFlag The status flag, of type dspi_status_and_interrupt_request_t
 */
static inline void DSPI_HAL_ClearStatusFlag(SPI_Type * baseAddr,
                                              dspi_status_and_interrupt_request_t statusFlag)
{
    SPI_WR_SR(baseAddr, (0x1U << statusFlag));
}


/*!
 * @brief Gets the DSPI FIFO counter or pointer.
 *
 * This function returns the number of entries or the next pointer in the Tx or Rx FIFO.
 * The parameters to pass in are the baseAddr and either the Tx or Rx FIFO counter or a
 * pointer.  The latter  is an enumeration type defined as the bitmask of
 * those particular bit fields found in the device header file. Example usage:
   @code
    DSPI_HAL_GetFifoCountOrPtr(baseAddr, kDspiRxFifoCounter);
   @endcode
 *
 * @param baseAddr Module base address
 * @param desiredParameter Desired parameter to obtain, of type dspi_fifo_counter_pointer_t
 * @return The number of entries or the next pointer in the Tx or Rx FIFO
 */
static inline uint32_t DSPI_HAL_GetFifoCountOrPtr(SPI_Type * baseAddr,
                                              dspi_fifo_counter_pointer_t desiredParameter)
{
    return ((SPI_RD_SR(baseAddr) >> desiredParameter) & 0xFU);
}


/*@}*/

/*!
 * @name Data transfer
 * @{
 */

/*!
 * @brief Reads data from the data buffer.
 *
 * @param baseAddr Module base address
 * @return The data from the read data buffer
 */
static inline uint32_t DSPI_HAL_ReadData(SPI_Type * baseAddr)
{
    return SPI_RD_POPR(baseAddr);
}

/*!
 * @brief Writes data into the data buffer, slave mode.
 *
 * In slave mode, up to 32-bit words may be written.
 *
 * @param baseAddr Module base address
 * @param data The data to send
 */
static inline void DSPI_HAL_WriteDataSlavemode(SPI_Type * baseAddr, uint32_t data)
{
    SPI_WR_PUSHR_SLAVE(baseAddr, data);
}

/*!
 * @brief Writes data into the data buffer, slave mode and waits till data was transmitted and return .
 *
 * In slave mode, up to 32-bit words may be written. Function firstly clear transmit complete flag
 * then write data into data register, finally wait tills the data transmitted.
 *
 * @param baseAddr Module base address
 * @param data The data to send
 */
void DSPI_HAL_WriteDataSlavemodeBlocking(SPI_Type * baseAddr, uint32_t data);

