hulei123/git123/apps/bus_pal/MKV46F15/dspi/fsl_dspi_hal.h
/*!
 * @brief Writes data into the data buffer, master mode.
 *
 * In master mode, the 16-bit data is appended to the 16-bit command info. The command portion
 * provides characteristics of the data such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). This is an example:
   @code
    dspi_command_config_t commandConfig;
    commandConfig.isChipSelectContinuous = true;
    commandConfig.whichCtar = kDspiCtar0;
    commandConfig.whichPcs = kDspiPcs1;
    commandConfig.clearTransferCount = false;
    commandConfig.isEndOfQueue = false;
    DSPI_HAL_WriteDataMastermode(baseAddr, &commandConfig, dataWord);
   @endcode
 *
 * @param baseAddr Module base address
 * @param command Pointer to command structure
 * @param data The data word to be sent
 */
void DSPI_HAL_WriteDataMastermode(SPI_Type * baseAddr,
                                  dspi_command_config_t * command,
                                  uint16_t data);

/*!
 * @brief Writes data into the data buffer, master mode and waits till complete to return.
 *
 * In master mode, the 16-bit data is appended to the 16-bit command info. The command portion
 * provides characteristics of the data such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). This is an example:
   @code
    dspi_command_config_t commandConfig;
    commandConfig.isChipSelectContinuous = true;
    commandConfig.whichCtar = kDspiCtar0;
    commandConfig.whichPcs = kDspiPcs1;
    commandConfig.clearTransferCount = false;
    commandConfig.isEndOfQueue = false;
    DSPI_HAL_WriteDataMastermodeBlocking(baseAddr, &commandConfig, dataWord);
   @endcode
 *
 * Note that this function does not return until after the transmit is complete. Also note that
 * the DSPI must be enabled and running in order to transmit data (MCR[MDIS] & [HALT] = 0).
 * Since the SPI is a synchronous protocol, receive data is available when transmit completes.
 *
 * @param baseAddr Module base address
 * @param command Pointer to command structure
 * @param data The data word to be sent
 */
void DSPI_HAL_WriteDataMastermodeBlocking(SPI_Type * baseAddr,
                                          dspi_command_config_t * command,
                                          uint16_t data);

/*!
 * @brief Writes a 32-bit data word (16-bit command appended with 16-bit data) into the data
 *        buffer, master mode.
 *
 * In this function, the user must append the 16-bit data to the 16-bit command info then
 * provide the total 32-bit word as the data to send.
 * The command portion provides characteristics of the data such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). The user is responsible for appending this command
 * with the data to send.  This is an example:
   @code
    dataWord = <16-bit command> | <16-bit data>;
    DSPI_HAL_WriteCmdDataMastermode(baseAddr, dataWord);
   @endcode
 *
 * @param baseAddr Module base address
 * @param data The data word (command and data combined) to be sent
 */
static inline void DSPI_HAL_WriteCmdDataMastermode(SPI_Type * baseAddr, uint32_t data)
{
    SPI_WR_PUSHR(baseAddr, data);
}

/*!
 * @brief Writes a 32-bit data word (16-bit command appended with 16-bit data) into the data
 *        buffer, master mode and waits till complete to return.
 *
 * In this function, the user must append the 16-bit data to the 16-bit command info then
 * provide the total 32-bit word as the data to send.
 * The command portion provides characteristics of the data such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). The user is responsible for appending this command
 * with the data to send.  This is an example:
   @code
    dataWord = <16-bit command> | <16-bit data>;
    DSPI_HAL_WriteCmdDataMastermodeBlocking(baseAddr, dataWord);
   @endcode
 *
 * Note that this function does not return until after the transmit is complete. Also note that
 * the DSPI must be enabled and running in order to transmit data (MCR[MDIS] & [HALT] = 0).
 * Since the SPI is a synchronous protocol, receive data is available when transmit completes.
 *
 * @param baseAddr Module base address
 * @param data The data word (command and data combined) to be sent
 */
void DSPI_HAL_WriteCmdDataMastermodeBlocking(SPI_Type * baseAddr, uint32_t data);

/*!
 * @brief Gets the transfer count.
 *
 * This function returns the current value of the DSPI Transfer Count Register.
 *
 * @param baseAddr Module base address
 * @return The current transfer count
 */
static inline uint32_t DSPI_HAL_GetTransferCount(SPI_Type * baseAddr)
{
    return SPI_RD_TCR_SPI_TCNT(baseAddr);
}

/*!
 * @brief Pre-sets the transfer count.
 *
 * This function allows the caller to pre-set the DSI Transfer Count Register to a desired value up
 * to 65535; Incrementing past this resets the counter back to 0.
 *
 * @param baseAddr Module base address
 * @param presetValue The desired pre-set value for the transfer counter
 */
static inline void DSPI_HAL_PresetTransferCount(SPI_Type * baseAddr, uint16_t presetValue)
{
    SPI_WR_TCR_SPI_TCNT(baseAddr, presetValue);
}

/*!
 * @brief Returns the DSPI command word formatted to the PUSHR data register bit field.
 *
 * This function allows the caller to pass in the data command structure and returns the command
 * word formatted according to the DSPI PUSHR register bit field placement. The user can then
 * "OR" the returned command word with the desired data to send and use the function
 * DSPI_HAL_WriteCmdDataMastermode or DSPI_HAL_WriteCmdDataMastermodeBlocking to write the
 * entire 32-bit command data word to the PUSHR.
 * This helps improve performance in cases where the command structure is constant.
 * For example, the user calls this function before starting a transfer to generate the
 * command word.  When they are ready to transmit the data, they would OR this formatted command
 * word with the desired data to transmit.
 * This process increases transmit performance when compared to calling send functions such as
 * DSPI_HAL_WriteDataMastermode which format the command word each time a data word is
 * to be sent.
 *
 * @param baseAddr Module base address
 * @param command Pointer to command structure
 * @return The command word formatted to the PUSHR data register bit field
 */
uint32_t DSPI_HAL_GetFormattedCommand(SPI_Type * baseAddr, dspi_command_config_t * command);

/*@}*/

/*!
 * @name Debug
 * @{
 */

/*!
 * @brief Reads FIFO registers for debug purposes.
 *
 * @param baseAddr Module base address
 * @param whichFifo Selects Tx or Rx FIFO, of type dspi_fifo_t.
 * @param whichFifoEntry Selects which FIFO entry to read: 0, 1, 2, or 3.
 * @return The desired FIFO register contents
 */
uint32_t DSPI_HAL_GetFifoData(SPI_Type * baseAddr, dspi_fifo_t whichFifo, uint32_t whichFifoEntry);

/*!
 * @brief Configures the DSPI to halt during debug mode.
 *
 * @param baseAddr Module base address
 * @param enable Enables (true) debug mode to halt transfers, else disable to not halt transfer
 *               in debug mode.
 */
static inline void DSPI_HAL_SetHaltInDebugmodeCmd(SPI_Type * baseAddr, bool enable)
{
    SPI_WR_MCR_FRZ(baseAddr, (enable == true));
}

/* @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_DSPI_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

